# **19IT016 Manav Butani**
# Week 2: Pandas

In [8]:
import pandas as pd

***Creating data frame***

In [9]:
dict1 = {
    "Name":["Manav","Raj","Rut","Jenish"],
    "Marks":[90,91,92,93],
    "city":["Anand","Junagadh","Surat","nadiad"]
}

In [10]:
df = pd.DataFrame(dict1)

In [11]:
df

     Name  Marks      city
0   Manav     90     Anand
1     Raj     91  Junagadh
2     Rut     92     Surat
3  Jenish     93    nadiad

***Reading files***

In [15]:
pd.read_csv("C:\\Users\\Manav\\Music\\Untitled Folder\\manav.csv")

    Train No Arrival Departure  Traveling Time   Price
0        NaN     NaN       NaN             NaN     NaN
1       21.0    8 hr      8 hr             9.0   555.0
2       12.0    9 hr      9 hr             8.0    66.0
3       24.0   10 hr     10 hr             7.0    99.0
4     3568.0   11 hr     11 hr             6.0  1000.0
5  4896415.0    7 hr      7 hr             5.0   562.0
6      567.0   21 hr     21 hr             4.0   789.0
7     1654.0   20 hr     20 hr             3.0    15.0

***Slicing manipulations***

In [16]:
df.iloc[0:3, 1:4]

   Marks      city
0     90     Anand
1     91  Junagadh
2     92     Surat

In [17]:
df[0:2] # first two rows

    Name  Marks      city
0  Manav     90     Anand
1    Raj     91  Junagadh

In [18]:
df.loc[0, ['Name', 'city']]

Name    Manav
city    Anand
Name: 0, dtype: object

***Exporting data to files***

In [19]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

In [20]:
x= pd.DataFrame(mydataset)

In [21]:
x.to_csv("cardata.csv")

***Columns and row manipulations with loops***

In [22]:
student_data = {'First_name': ['Manav', 'Mohan', 'Tina', 'Jeetu', 'Meera'], 
                'Last_name': ['Butani', 'Sharma', 'Ali', 'Gandhi', 'Kumari'], 
                'Marks': [50, 52, 16, 105, 23] }

In [23]:
df1 = pd.DataFrame(student_data)

In [24]:
result = []
for value in df1["Marks"]:
    if value < 0 or value > 100:
        result.append("Invalid")
    elif value>=33:
        result.append("Pass")
    else:
        result.append("Fail")
       
df1["Result"] = result 
print(df1)

  First_name Last_name  Marks   Result
0      Manav    Butani     50     Pass
1      Mohan    Sharma     52     Pass
2       Tina       Ali     16     Fail
3      Jeetu    Gandhi    105  Invalid
4      Meera    Kumari     23     Fail

In [25]:
for i, row in df1.iterrows():
	print(f"Index: {i}")
	print(f"{row}\n")

Index: 0
First_name     Manav
Last_name     Butani
Marks             50
Result          Pass
Name: 0, dtype: object

Index: 1
First_name     Mohan
Last_name     Sharma
Marks             52
Result          Pass
Name: 1, dtype: object

Index: 2
First_name    Tina
Last_name      Ali
Marks           16
Result        Fail
Name: 2, dtype: object

Index: 3
First_name      Jeetu
Last_name      Gandhi
Marks             105
Result        Invalid
Name: 3, dtype: object

Index: 4
First_name     Meera
Last_name     Kumari
Marks             23
Result          Fail
Name: 4, dtype: object

***Use pandas for masking data and reading if in Boolean format.***

In [26]:
MANAV= {
    "A":[True,False,True,False],
    "b":[False,False,True,True],
    "A":[False,False,False,False]
}

DF0 = pd.DataFrame(MANAV)
DF0

       A      b
0  False  False
1  False  False
2  False   True
3  False   True

In [27]:
DF0.mask(DF0 <=0,"19IT16")

        A       b
0  19IT16  19IT16
1  19IT16  19IT16
2  19IT16    True
3  19IT16    True

In [28]:
df2 = pd.DataFrame({"A":[12, 4, 5, None, 1],
                   "B":[7, 2, 54, 3, None],
                   "C":[20, 16, 11, 3, 8],
                   "D":[14, 3, None, 2, 6]})

In [29]:
df2.mask(df2.isna(), "19it016")

         A        B   C        D
0     12.0      7.0  20     14.0
1      4.0      2.0  16      3.0
2      5.0     54.0  11  19it016
3  19it016      3.0   3      2.0
4      1.0  19it016   8      6.0

In [30]:
df3 = pd.DataFrame({"A":[12, 4, 5, 44, 1],
                   "B":[5, 2, 54, 3, 2],
                   "C":[20, 16, 7, 3, 8],
                   "D":[14, 3, 17, 2, 6]})

In [31]:
df3.mask(df3 > 10, -25)

    A   B   C   D
0 -25   5 -25 -25
1   4   2 -25   3
2   5 -25   7 -25
3 -25   3   3   2
4   1   2   8   6